# Append Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementArray..::..Append Method
ElementArray Class See Also
---
Add the element to the end of the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Append(
	Element item
)
```

Visual Basic
---
```text
Public Overridable Sub Append ( _
	item As Element _
)
```

Visual C++
---
```text
public:
virtual void Append(
	Element^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..ElementThe element to be added.
# See Also
ElementArray Class
Autodesk.Revit.DB Namespace